
&После("ОбработкаПроведения")
Процедура влн_ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое метода.
	Если (ЭтотОбъект.РучнаяКорректировка) Тогда
		Возврат;
	КонецЕсли;
	
	Если (ЭтотОбъект.КорректироватьНДС) И (НЕ ЭтотОбъект.КорректироватьБУиНУ) И (ЭтотОбъект.ДокументРеализации.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности) Тогда
		
		Счет6201  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01");
		Счет90011 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.01.1");
		Счет9003  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.03");
		Счет1909  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("19.09");
		
		структураОбщая = Новый Структура();
		структураОбщая.Вставить("Период", ЭтотОбъект.Дата);
		структураОбщая.Вставить("Организация", ЭтотОбъект.Организация);
		
		Для Каждого стр из ЭтотОбъект.Товары Цикл
			суммаНДС = стр.СуммаНДС - стр.СуммаНДСДоКорректировки;
			суммаСНДС = стр.Сумма - стр.СуммаДоКорректировки;
			
			запись = ЭтотОбъект.Движения.Хозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(запись,структураОбщая);
			
			запись.Сумма = суммаСНДС;
			запись.СуммаНУДт = суммаСНДС;
			//запись.СуммаПРДт = запись.Сумма -запись.СуммаНУДт;
			запись.СуммаНУКт = суммаСНДС - суммаНДС ;
			//запись.СуммаПРКт = запись.Сумма -запись.СуммаНУКт;
			
			запись.СчетДт = Счет6201;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,1, ЭтотОбъект.Контрагент);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,2, ЭтотОбъект.ДоговорКонтрагента);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,3, ЭтотОбъект.ДокументРеализации);			
			запись.СчетКт = Счет90011;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,1, стр.Номенклатура.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,2, стр.СтавкаНДС);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,3, стр.Номенклатура);
			
			
			запись = ЭтотОбъект.Движения.Хозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(запись,структураОбщая);
			
			запись.СчетДт = Счет9003;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,1, стр.Номенклатура.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,2, стр.СтавкаНДС);
			запись.СчетКт = Счет1909;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,1, ЭтотОбъект.Контрагент);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,2, ЭтотОбъект.ДокументРеализации);
			
			запись.Сумма = суммаНДС;
			запись.СуммаНУДт = 0;
			//запись.СуммаПРДт = запись.СуммаНУДт - запись.Сумма;
			запись.СуммаНУКт = 0;
			//запись.СуммаПРКт = запись.СуммаНУКт - запись.Сумма;

		КонецЦикла;
	КонецЕсли;
	ЭтотОбъект.Движения.Хозрасчетный.Записать();
КонецПроцедуры
