&НаСервере
Функция УстановитьДоступность_влн_РеализацияПрочих()
	флагЕсть9101 = Ложь;
	счет9101 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.01");
	Для Каждого стр из Объект.ОС Цикл
		Если стр.СчетДоходов = счет9101 Тогда
			флагЕсть9101 = истина;
		Конецесли;
	КонецЦикла;
	
	Если флагЕсть9101 = ложь Тогда
		Объект.влн_РеализацияПрочих = Ложь;
	КонецЕсли;
	
	Элементы.влн_РеализацияПрочих.Доступность = флагЕсть9101;
	
КонецФУнкции


&НаКлиенте
Процедура влн_ОСПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	УстановитьДоступность_влн_РеализацияПрочих();
КонецПроцедуры


&НаКлиенте
Процедура влн_ОССчетДоходовПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	УстановитьДоступность_влн_РеализацияПрочих();
КонецПроцедуры


&НаСервере
Процедура влн_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// Вставить содержимое обработчика.
	УстановитьДоступность_влн_РеализацияПрочих();
КонецПроцедуры

