
&Вместо("СоздатьНезаполненнуюНоменклатуру")
Процедура влн_СоздатьНезаполненнуюНоменклатуру()
	// Вставить содержимое метода.
	//ПродолжитьВызов();
	
		ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиСоздатьЭлементыМалоценка());
	
	НоменклатураПоНаименованию = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из ОС Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			НаименованиеОС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.ОсновноеСредство, "Наименование");
			НаименованиеОС = НаименованиеОС + " инв. №"+СокрЛП(ПолучитьинвентарныйНомер(СтрокаТаблицы.ОсновноеСредство));
			Номенклатура = НоменклатураПоНаименованию.Получить(НаименованиеОС);
			
			Если Номенклатура = Неопределено Тогда
				НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
				НоменклатураОбъект.Заполнить(ДанныеЗаполнения);
				НоменклатураОбъект.Наименование = НаименованиеОС;
				НоменклатураОбъект.НаименованиеПолное = НаименованиеОС;
				НоменклатураОбъект.Записать();
				Номенклатура = НоменклатураОбъект.Ссылка;
				НоменклатураПоНаименованию.Вставить(НаименованиеОС, Номенклатура);
			КонецЕсли;
			
			СтрокаТаблицы.Номенклатура = Номенклатура;
		КонецЕсли;
	КонецЦикла;

	
	
КонецПроцедуры

Функция ПолучитьинвентарныйНомер(ос)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	инв.ИнвентарныйНомер КАК ИнвентарныйНомер
	               |ИЗ
	               |	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(, ОсновноеСредство = &ос) КАК инв";
	
	Запрос.УстановитьПараметр("ОС",ос);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат рез.ИнвентарныйНомер;
	КонецЕсли;
	
КонецфУнкции
