
&Вместо("ПриУстановкеНовогоКода")
Процедура влн_ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	// Вставить содержимое обработчика.
	//ПродолжитьВызов(СтандартнаяОбработка, Префикс);
	
	СтандартнаяОбработка = ложь;
	ЭтотОбъект.код = НайтиНовыйКод();
КонецПроцедуры


Функция НайтиНовыйКод()
	результат = неопределено;
	разряд = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ОсновныеСредства.Код) КАК Код
	               |ИЗ
	               |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |ГДЕ
	               |	ОсновныеСредства.Код ПОДОБНО &маскаПоиска";
	
	Пока (результат = неопределено) и разряд<10 Цикл
		маскаПоиска = "00-"+разряд+"[0-9][0-9][0-9][0-9][0-9]";
		Запрос.УстановитьПараметр("маскаПоиска",маскаПоиска);
		рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Если ЗначениеЗаполнено(Рез.Код) Тогда
				тест = Число(Прав(СокрЛП(Рез.Код),6));
				Если тест<999999 Тогда
					тест = 1000000+тест+1;
					тест = Прав(Формат(тест, "ЧГ=0; ЧВН="),6);
					результат = "00-"+тест;
				КонецЕсли;
			Иначе
				результат = "00-"+разряд+"0000"+?(разряд = 0,1,0);			
			КонецЕсли;
		КонецЕсли;
		разряд = разряд +1;
	КонецЦикла;
	
	Возврат результат;
КонецФункции
