
Функция КопироватьЗначенияСубконт(субконтоПриемник, субконтоИсточник)
	инд = 0; 
	Для Каждого эл из субконтоИсточник Цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			субконтоПриемник[эл.Ключ] = эл.Значение;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция КопироватьПроводку(назначение, источник) ЭКСПОРТ
	ЗаполнитьЗначенияСвойств(назначение,источник, "Период, СчетДт, СчетКт, Содержание, Организация, ВалютаДт, ВалютаКт, ПодразделениеДт, ПодразделениеКт");
	ЗаполнитьЗначенияСвойств(назначение,источник, "Сумма, СуммаНУДт, СуммаПРДт, СуммаВРДт, СуммаНУКт, СуммаПРКт, СуммаВРКт");
	
	//ЗаполнитьЗначенияСвойств(назначение,источник, "СубконтоДт, СубконтоКт");
	
	КопироватьЗначенияСубконт(назначение.СубконтоДт,источник.СубконтоДт);
	КопироватьЗначенияСубконт(назначение.СубконтоКт,источник.СубконтоКт);
	//БухгалтерскийУчет.УстановитьСубконто(назначение.СчетДт,назначение.СубконтоДт,1,источник.СубконтоДт);
	//БухгалтерскийУчет.УстановитьСубконто(назначение.СчетДт,назначение.СубконтоДт,2,источник.СубконтоДт);
	//БухгалтерскийУчет.УстановитьСубконто(назначение.СчетДт,назначение.СубконтоДт,3,источник.СубконтоДт);
	//
	//БухгалтерскийУчет.УстановитьСубконто(назначение.СчетКт,назначение.СубконтоКт,1,источник.СубконтоКт);
	//БухгалтерскийУчет.УстановитьСубконто(назначение.СчетКт,назначение.СубконтоКт,2,источник.СубконтоКт);
	//БухгалтерскийУчет.УстановитьСубконто(назначение.СчетКт,назначение.СубконтоКт,3,источник.СубконтоКт);
КонецФУнкции


Функция КорректировкаПроводкиОбъекта_НДС_с_прочей_реализации(Объект,Отказ, РежимПроведения) ЭКСПОРТ
	Если Объект.влн_РеализацияПрочих = Истина Тогда		
		счет6802 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("68.02");
		счет9101 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.01");
		счет9102 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.02");
		статьяДляНДС = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("55");  //НДС с прочей  реализации
		
		всего = Объект.Движения.Хозрасчетный.Количество();
		инд = 0;
		Для инд = 0 по всего-1 Цикл
			запись = Объект.Движения.Хозрасчетный[инд];
			Если (запись.СчетДт = счет9102)И(запись.СчетКт = счет6802) Тогда
				запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы] = статьяДляНДС;
			КонецЕсли;
			Если (запись.СчетКт = счет9101) И(запись.СуммаНУДт <> запись.СуммаНУКт) Тогда
				
				дельта = запись.СуммаНУДт - запись.СуммаНУКт;
				новаяЗапись = Объект.Движения.Хозрасчетный.Добавить();
				
				влн_Хозрасчетный.КопироватьПроводку(новаяЗапись, запись);
				
				запись.СуммаНУДт = запись.СуммаНУКт;
				запись.Сумма = запись.СуммаНУКт;
				
				новаяЗапись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы] = статьяДляНДС;
				новаяЗапись.СуммаНУДт = дельта;
				новаяЗапись.СуммаНУКт = 0;
				новаяЗапись.СуммаПРКт = 0;
				новаяЗапись.СуммаВРКт = 0;
				новаяЗапись.Сумма = дельта;

				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецФункции